//=============================================================================
//
// シーン処理 [title.cpp]
// Author : GP12A295 25 人見友基
//
//=============================================================================
#include "scene.h"
#include "title.h"
#include "game.h"
#include "result.h"

/* 全体で使うインクルード */
#include "camera.h"
#include "light.h"
#include "input.h"

/* デバッグ */
#ifdef _DEBUG
#include "debugproc.h"
#endif

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************
//始めはシーンを空にしておく
BaseScene *SceneManager::m_pScene = NULL;

//=============================================================================
// シーン管理処理
//=============================================================================
void SceneManager::ChangeScene(SCENE scene)
{
	if (m_pScene != NULL)
	{
		delete m_pScene;
	}

	switch (scene)
	{	//引数のシーン
	case SCENE::TITLE:
		m_pScene = new TitleScene();	//タイトルシーンを現在のシーンにする
		break;
	case SCENE::GAME:
		m_pScene = new GameScene();		//ゲームシーンを現在のシーンにする
		break;
	case SCENE::RESULT:
		m_pScene = new ResultScene();	//リザルトシーンを現在のシーンにする
		break;
	default:
		break;
	}
}

//=============================================================================
// 初期化処理
//=============================================================================
void SceneManager::Init(HINSTANCE hInst, HWND hWnd)
{
	ChangeScene(TITLE);			// 初期シーン設定
	InitLight();				// ライト

	InitInput(hInst, hWnd);		// 入力
	InitCamera();				// カメラ

	//InitSound(hWnd);			// サウンド
	//InitFade();					// フェード

#ifdef _DEBUG
	InitDebugProc();			// デバッグ
#endif
}

//=============================================================================
// 終了処理
//=============================================================================
void SceneManager::Uninit()
{
	UninitInput();			// 入力
	UninitCamera();			// カメラ

	//UninitSound();			// サウンド
	//UninitFade();			// フェード

#ifdef _DEBUG
	UninitDebugProc();		// デバッグ
#endif
}

//=============================================================================
// 更新処理
//=============================================================================
void SceneManager::Update()
{
	m_pScene->Update();		//現在のシーンの更新関数
}

//=============================================================================
// 描画処理
//=============================================================================
void SceneManager::Draw()
{
	m_pScene->Draw();		//現在のシーンの描画関数
}

//=============================================================================
// コンストラクタ処理
//=============================================================================
SceneManager::SceneManager(void)
{

}

//=============================================================================
// デストラクタ処理
//=============================================================================
SceneManager::~SceneManager(void)
{

}