//=============================================================================
//
// シーン処理 [scene.cpp]
// Author : GP12A295 25 人見友基
//
//=============================================================================
#ifndef _SCENE_H_
#define _SCENE_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class BaseScene
{
public:
	virtual void Update(void) = 0;
	virtual void Draw(void) = 0;
};

class SceneManager
{
public:
	enum SCENE 
	{
		TITLE,
		GAME,
		RESULT
	};
	SceneManager(void);
	~SceneManager(void);
	static void ChangeScene(SCENE scene);			// シーンを引数によって変える関数
	static void Init(HINSTANCE hInst, HWND hWnd);	// シーンの初期化関数
	static void Uninit(void);						// シーンの終了関数
	static void Update(void);						// シーンの更新関数
	static void Draw(void);							// シーンの描画関数
private:
	static BaseScene *m_pScene;						//現在のシーン
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

#endif